In [3]:
# Reading file from give url with CSV format. Pandas Dataframe that function
import pandas as pd # Pandas Dataframe
import numpy as np  # Numpy package 
import matplotlib.pyplot as plt # Ploting package 
# Reading csv in pandas DF
data_set_1 =pd.read_csv('https://raw.githubusercontent.com/jackiekazil/data-wrangling/master/data/chp3/data-text.csv')

In [4]:
# printing result which raised in query and other information to view dataset 
print ("Shape of Data Row * Columns :\t", data_set_1.shape)
print ("Columns Name in Data Set    :\t", data_set_1.columns)
print ("Top 3 Rows of Data Set      :\t", data_set_1.head(3))
print ("~~*~~"*10)
print ("Data Set information --:\n")
print (data_set_1.info())

Shape of Data Row * Columns :	 (4656, 12)
Columns Name in Data Set    :	 Index(['Indicator', 'PUBLISH STATES', 'Year', 'WHO region',
       'World Bank income group', 'Country', 'Sex', 'Display Value', 'Numeric',
       'Low', 'High', 'Comments'],
      dtype='object')
Top 3 Rows of Data Set      :	                            Indicator PUBLISH STATES  Year WHO region  \
0   Life expectancy at birth (years)      Published  1990     Europe
1   Life expectancy at birth (years)      Published  2000     Europe
2  Life expectancy at age 60 (years)      Published  2012     Europe

  World Bank income group  Country         Sex  Display Value  Numeric  Low  \
0             High-income  Andorra  Both sexes             77     77.0  NaN
1             High-income  Andorra  Both sexes             80     80.0  NaN
2             High-income  Andorra      Female             28     28.0  NaN

   High  Comments
0   NaN       NaN
1   NaN       NaN
2   NaN       NaN
~~*~~~~*~~~~*~~~~*~~~~*~~~~*~~~~*~~~~*~~~~*~~~~*~~
Data Set information --:

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4656 entries, 0 to 4655
Data columns (total 12 columns):
Indicator                  4656 non-null object
PUBLISH STATES             4656 non-null object
Year                       4656 non-null int64
WHO region                 4656 non-null object
World Bank income group    4656 non-null object
Country                    4656 non-null object
Sex                        4656 non-null object
Display Value              4656 non-null int64
Numeric                    4656 non-null float64
Low                        0 non-null float64
High                       0 non-null float64
Comments                   0 non-null float64
dtypes: float64(4), int64(2), object(6)
memory usage: 436.6+ KB
None

In [5]:
# another link prvovide in assignment which loaded into pandas df
data_set_2 = pd.read_csv("https://raw.githubusercontent.com/kjam/data-wrangling-pycon/master/data/berlin_weather_oldest.csv")

In [6]:
# printing result which raised in query and other information to view dataset 
print ("Shape of Data Row * Columns :\t", data_set_2.shape)
print ("Columns Name in Data Set    :\t", data_set_2.columns)
print ("Top 3 Rows of Data Set      :\t", data_set_2.head(3))
print ("~~*~~"*10)
print ("Data Set information --:\n")
print (data_set_2.info())

Shape of Data Row * Columns :	 (117208, 21)
Columns Name in Data Set    :	 Index(['STATION', 'STATION_NAME', 'DATE', 'PRCP', 'SNWD', 'SNOW', 'TMAX',
       'TMIN', 'WDFG', 'PGTM', 'WSFG', 'WT09', 'WT07', 'WT01', 'WT06', 'WT05',
       'WT04', 'WT16', 'WT08', 'WT18', 'WT03'],
      dtype='object')
Top 3 Rows of Data Set      :	              STATION         STATION_NAME      DATE  PRCP  SNWD  SNOW  TMAX  \
0  GHCND:GME00111445  BERLIN TEMPELHOF GM  19310101    46 -9999 -9999 -9999
1  GHCND:GME00111445  BERLIN TEMPELHOF GM  19310102   107 -9999 -9999    50
2  GHCND:GME00111445  BERLIN TEMPELHOF GM  19310103 -9999 -9999 -9999    28

   TMIN  WDFG  PGTM  ...   WT09  WT07  WT01  WT06  WT05  WT04  WT16  WT08  \
0   -11 -9999 -9999  ...  -9999 -9999 -9999 -9999 -9999 -9999 -9999 -9999
1    11 -9999 -9999  ...  -9999 -9999 -9999 -9999 -9999 -9999 -9999 -9999
2    11 -9999 -9999  ...  -9999 -9999 -9999 -9999 -9999 -9999 -9999 -9999

   WT18  WT03
0 -9999 -9999
1 -9999 -9999
2 -9999 -9999

[3 rows x 21 columns]
~~*~~~~*~~~~*~~~~*~~~~*~~~~*~~~~*~~~~*~~~~*~~~~*~~
Data Set information --:

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 117208 entries, 0 to 117207
Data columns (total 21 columns):
STATION         117208 non-null object
STATION_NAME    117208 non-null object
DATE            117208 non-null int64
PRCP            117208 non-null int64
SNWD            117208 non-null int64
SNOW            117208 non-null int64
TMAX            117208 non-null int64
TMIN            117208 non-null int64
WDFG            117208 non-null int64
PGTM            117208 non-null int64
WSFG            117208 non-null int64
WT09            117208 non-null int64
WT07            117208 non-null int64
WT01            117208 non-null int64
WT06            117208 non-null int64
WT05            117208 non-null int64
WT04            117208 non-null int64
WT16            117208 non-null int64
WT08            117208 non-null int64
WT18            117208 non-null int64
WT03            117208 non-null int64
dtypes: int64(19), object(2)
memory usage: 18.8+ MB
None

In [7]:
# Get the row index number from the above DF 
import numpy as np
print ("Expected Output for First Data Set :")
print (np.where(data_set_1.Sex !=0))
print ("Expected Output for Second Data Set :")
print (np.where(data_set_2.STATION != "nan"))# getting Nan values and result in shown as np array

Expected Output for First Data Set :
(array([   0,    1,    2, ..., 4653, 4654, 4655], dtype=int64),)
Expected Output for Second Data Set :
(array([     0,      1,      2, ..., 117205, 117206, 117207], dtype=int64),)

In [8]:
## Renaming over memory of data frame not changed permanently
data_set_1.rename(columns={"Indicator":"Indicator_id"})
print ("When Column name not renamed permanently :")
print (data_set_1.columns)
print ("~~*~~*~~"*10)
## Renamed permanently of column name
data_set_1.rename(columns={"Indicator":"Indicator_id"},inplace=True)
print ("Columns name after changes done over One Column")
print (data_set_1.columns)
print ("~~*~~*~~"*10)
## Renaming Mulitple Columns 
data_set_1.columns = data_set_1.columns.str.lower()
data_set_1.columns = data_set_1.columns.str.replace(" ","_")
print ("Columns name after changes done over One Column")
print (data_set_1.columns)

When Column name not renamed permanently :
Index(['Indicator', 'PUBLISH STATES', 'Year', 'WHO region',
       'World Bank income group', 'Country', 'Sex', 'Display Value', 'Numeric',
       'Low', 'High', 'Comments'],
      dtype='object')
~~*~~*~~~~*~~*~~~~*~~*~~~~*~~*~~~~*~~*~~~~*~~*~~~~*~~*~~~~*~~*~~~~*~~*~~~~*~~*~~
Columns name after changes done over One Column
Index(['Indicator_id', 'PUBLISH STATES', 'Year', 'WHO region',
       'World Bank income group', 'Country', 'Sex', 'Display Value', 'Numeric',
       'Low', 'High', 'Comments'],
      dtype='object')
~~*~~*~~~~*~~*~~~~*~~*~~~~*~~*~~~~*~~*~~~~*~~*~~~~*~~*~~~~*~~*~~~~*~~*~~~~*~~*~~
Columns name after changes done over One Column
Index(['indicator_id', 'publish_states', 'year', 'who_region',
       'world_bank_income_group', 'country', 'sex', 'display_value', 'numeric',
       'low', 'high', 'comments'],
      dtype='object')

In [9]:
### Arrange Values of Particular column in Asending Order.
Asending_order_df = data_set_1.sort_values(['year'],ascending=True)
print (Asending_order_df.head()) # Showing First 5 Record on Shorting the data

                           indicator_id publish_states  year who_region  \
0      Life expectancy at birth (years)      Published  1990     Europe
1270   Life expectancy at birth (years)      Published  1990     Europe
3193   Life expectancy at birth (years)      Published  1990     Europe
3194   Life expectancy at birth (years)      Published  1990     Europe
3197  Life expectancy at age 60 (years)      Published  1990     Europe

     world_bank_income_group              country         sex  display_value  \
0                High-income              Andorra  Both sexes             77
1270             High-income              Germany        Male             72
3193     Lower-middle-income  Republic of Moldova        Male             65
3194     Lower-middle-income  Republic of Moldova  Both sexes             68
3197     Lower-middle-income  Republic of Moldova        Male             15

      numeric  low  high  comments
0        77.0  NaN   NaN       NaN
1270     72.0  NaN   NaN       NaN
3193     65.0  NaN   NaN       NaN
3194     68.0  NaN   NaN       NaN
3197     15.0  NaN   NaN       NaN

In [10]:
### Arrange multiple colums values in ascending order
Muliple_columns = data_set_1[["indicator_id","country","year","who_region","publish_states"]]
print (Muliple_columns.head()) # Extracted Columns and printed over First 5 Records

                        indicator_id               country  year  \
0   Life expectancy at birth (years)               Andorra  1990
1   Life expectancy at birth (years)               Andorra  2000
2  Life expectancy at age 60 (years)               Andorra  2012
3  Life expectancy at age 60 (years)               Andorra  2000
4   Life expectancy at birth (years)  United Arab Emirates  2012

              who_region publish_states
0                 Europe      Published
1                 Europe      Published
2                 Europe      Published
3                 Europe      Published
4  Eastern Mediterranean      Published

In [11]:
## Make Country as First Column in Data Set Frame 
List_of_col = data_set_1.columns.tolist() # Getting list of Columns
List_of_col.insert(0, List_of_col.pop(List_of_col.index('country'))) # Removed the country from list
data_set_1 = data_set_1.reindex(columns= List_of_col) # Reindexing the index
print (data_set_1.head()) # First five records printed

                country                       indicator_id publish_states  \
0               Andorra   Life expectancy at birth (years)      Published
1               Andorra   Life expectancy at birth (years)      Published
2               Andorra  Life expectancy at age 60 (years)      Published
3               Andorra  Life expectancy at age 60 (years)      Published
4  United Arab Emirates   Life expectancy at birth (years)      Published

   year             who_region world_bank_income_group         sex  \
0  1990                 Europe             High-income  Both sexes
1  2000                 Europe             High-income  Both sexes
2  2012                 Europe             High-income      Female
3  2000                 Europe             High-income  Both sexes
4  2012  Eastern Mediterranean             High-income      Female

   display_value  numeric  low  high  comments
0             77     77.0  NaN   NaN       NaN
1             80     80.0  NaN   NaN       NaN
2             28     28.0  NaN   NaN       NaN
3             23     23.0  NaN   NaN       NaN
4             78     78.0  NaN   NaN       NaN

In [12]:
## Get the Column array using a variable
array_expected =[np.array(data_set_1.who_region)]
print (array_expected) # region wise 1-darray as request in Question

[array(['Europe', 'Europe', 'Europe', ..., 'Africa', 'Africa', 'Africa'],
      dtype=object)]

In [13]:
# Get the Subset rows 11,24 and 27
row_id = [11,24,27] # give row wise data need to be extracted
List_of_col = data_set_1.columns.tolist() # getting list of columns
List_of_col.insert(5, List_of_col.pop(List_of_col.index('country'))) # replaceing the country column to 6 postion 
data_set_1 = data_set_1.reindex(columns= List_of_col) # Re ~ index the column 
expected_rows_df = pd.DataFrame(data_set_1.loc[x] for x in row_id) # getting / extrated the row requested in question
print (expected_rows_df) # printed the rows on screen

                         indicator_id publish_states  year       who_region  \
11   Life expectancy at birth (years)      Published  2012           Europe
24  Life expectancy at age 60 (years)      Published  2012  Western Pacific
27  Life expectancy at age 60 (years)      Published  1990         Americas

   world_bank_income_group            country     sex  display_value  numeric  \
11             High-income            Austria  Female             83     83.0
24             High-income  Brunei Darussalam  Female             21     21.0
27             High-income             Canada  Female             24     24.0

    low  high  comments
11  NaN   NaN       NaN
24  NaN   NaN       NaN
27  NaN   NaN       NaN

In [14]:
#Get the subset rows excluding 5,8, 12, 23, and 56
row_id_exclude = [2,5,8,12,15,23,56] # these row should be excluded from data frame
excluded_rows_df = pd.DataFrame(data_set_1.loc[x] for x in data_set_1.index if x not in row_id_exclude ) #
print (excluded_rows_df.head(10))

                         indicator_id publish_states  year  \
0    Life expectancy at birth (years)      Published  1990
1    Life expectancy at birth (years)      Published  2000
3   Life expectancy at age 60 (years)      Published  2000
4    Life expectancy at birth (years)      Published  2012
6   Life expectancy at age 60 (years)      Published  1990
7   Life expectancy at age 60 (years)      Published  2012
9    Life expectancy at birth (years)      Published  2000
10   Life expectancy at birth (years)      Published  2012
11   Life expectancy at birth (years)      Published  2012
13   Life expectancy at birth (years)      Published  2012

               who_region world_bank_income_group               country  \
0                  Europe             High-income               Andorra
1                  Europe             High-income               Andorra
3                  Europe             High-income               Andorra
4   Eastern Mediterranean             High-income  United Arab Emirates
6                Americas             High-income   Antigua and Barbuda
7                Americas             High-income   Antigua and Barbuda
9         Western Pacific             High-income             Australia
10        Western Pacific             High-income             Australia
11                 Europe             High-income               Austria
13                 Europe             High-income               Belgium

           sex  display_value  numeric  low  high  comments
0   Both sexes             77     77.0  NaN   NaN       NaN
1   Both sexes             80     80.0  NaN   NaN       NaN
3   Both sexes             23     23.0  NaN   NaN       NaN
4       Female             78     78.0  NaN   NaN       NaN
6         Male             17     17.0  NaN   NaN       NaN
7   Both sexes             22     22.0  NaN   NaN       NaN
9   Both sexes             80     80.0  NaN   NaN       NaN
10  Both sexes             83     83.0  NaN   NaN       NaN
11      Female             83     83.0  NaN   NaN       NaN
13      Female             83     83.0  NaN   NaN       NaN

In [15]:
## Reading Url given in assignments
def Print_format():
    print ("~~*~~"*15)
    
user_s = pd.read_csv("https://raw.githubusercontent.com/ben519/DataWrangling/master/Data/users.csv")
session_s =  pd.read_csv("https://raw.githubusercontent.com/ben519/DataWrangling/master/Data/sessions.csv")
product_s = pd.read_csv("https://raw.githubusercontent.com/ben519/DataWrangling/master/Data/products.csv")
transaction_s = pd.read_csv("https://raw.githubusercontent.com/ben519/DataWrangling/master/Data/transactions.csv")
Print_format()
print ("User Dataframe Top 5 Rows :- \n",user_s.head())
Print_format()
print ("Session Dataframe Top 5 Rows :- \n",session_s.head())
Print_format()
print ("Transaction Dataframe Top 5 Rows :- \n",transaction_s.head())
Print_format()

~~*~~~~*~~~~*~~~~*~~~~*~~~~*~~~~*~~~~*~~~~*~~~~*~~~~*~~~~*~~~~*~~~~*~~~~*~~
User Dataframe Top 5 Rows :-
    UserID      User  Gender  Registered   Cancelled
0       1   Charles    male  2012-12-21         NaN
1       2     Pedro    male  2010-08-01  2010-08-08
2       3  Caroline  female  2012-10-23  2016-06-07
3       4   Brielle  female  2013-07-17         NaN
4       5  Benjamin    male  2010-11-25         NaN
~~*~~~~*~~~~*~~~~*~~~~*~~~~*~~~~*~~~~*~~~~*~~~~*~~~~*~~~~*~~~~*~~~~*~~~~*~~
Session Dataframe Top 5 Rows :-
    SessionID SessionDate  UserID
0          1  2010-01-05       2
1          2  2010-08-01       2
2          3  2010-11-25       2
3          4  2011-09-21       5
4          5  2011-10-19       4
~~*~~~~*~~~~*~~~~*~~~~*~~~~*~~~~*~~~~*~~~~*~~~~*~~~~*~~~~*~~~~*~~~~*~~~~*~~
Transaction Dataframe Top 5 Rows :-
    TransactionID TransactionDate  UserID  ProductID  Quantity
0              1      2010-08-21     7.0          2         1
1              2      2011-05-26     3.0          4         1
2              3      2011-06-16     3.0          3         1
3              4      2012-08-26     1.0          2         3
4              5      2013-06-06     2.0          4         1
~~*~~~~*~~~~*~~~~*~~~~*~~~~*~~~~*~~~~*~~~~*~~~~*~~~~*~~~~*~~~~*~~~~*~~~~*~~

In [16]:
#Join users to transactions, keeping all rows from transactions and only matching rows from users (left join)
user_tranaction = transaction_s.merge(user_s,on='UserID',how='left') # left join on userid
user_tranaction.Registered.fillna('NaT',inplace=True) # filling Nan with NAt
user_tranaction.Cancelled.fillna('NaT',inplace=True)
print (user_tranaction) # printed the result

   TransactionID TransactionDate  UserID  ProductID  Quantity      User  \
0              1      2010-08-21     7.0          2         1       NaN
1              2      2011-05-26     3.0          4         1  Caroline
2              3      2011-06-16     3.0          3         1  Caroline
3              4      2012-08-26     1.0          2         3   Charles
4              5      2013-06-06     2.0          4         1     Pedro
5              6      2013-12-23     2.0          5         6     Pedro
6              7      2013-12-30     3.0          4         1  Caroline
7              8      2014-04-24     NaN          2         3       NaN
8              9      2015-04-24     7.0          4         3       NaN
9             10      2016-05-08     3.0          4         4  Caroline

   Gender  Registered   Cancelled
0     NaN         NaT         NaT
1  female  2012-10-23  2016-06-07
2  female  2012-10-23  2016-06-07
3    male  2012-12-21         NaT
4    male  2010-08-01  2010-08-08
5    male  2010-08-01  2010-08-08
6  female  2012-10-23  2016-06-07
7     NaN         NaT         NaT
8     NaN         NaT         NaT
9  female  2012-10-23  2016-06-07

In [17]:
## Which transaction have a Userid not in Users ?
Only_Nan_User_ = user_tranaction[pd.isnull(user_tranaction['User'])] # Created new df

Only_Nan_User_ = Only_Nan_User_[['TransactionID','TransactionDate','UserID','ProductID','Quantity']] # filter colummns
print (Only_Nan_User_) # result printed
Only_Nan_User_.isnull().sum()

   TransactionID TransactionDate  UserID  ProductID  Quantity
0              1      2010-08-21     7.0          2         1
7              8      2014-04-24     NaN          2         3
8              9      2015-04-24     7.0          4         3

TransactionID      0
TransactionDate    0
UserID             1
ProductID          0
Quantity           0
dtype: int64

In [18]:
# Join users to tranactions, keeping only rows from transactions and users that match via UserID (inner join)
user_tranaction_2 = transaction_s.merge(user_s,on='UserID',how='inner')
user_tranaction_2.Registered.fillna('NaT',inplace=True)
user_tranaction_2.UserID = user_tranaction_2.UserID.astype(np.int64)
print (user_tranaction_2)

   TransactionID TransactionDate  UserID  ProductID  Quantity      User  \
0              2      2011-05-26       3          4         1  Caroline
1              3      2011-06-16       3          3         1  Caroline
2              7      2013-12-30       3          4         1  Caroline
3             10      2016-05-08       3          4         4  Caroline
4              4      2012-08-26       1          2         3   Charles
5              5      2013-06-06       2          4         1     Pedro
6              6      2013-12-23       2          5         6     Pedro

   Gender  Registered   Cancelled
0  female  2012-10-23  2016-06-07
1  female  2012-10-23  2016-06-07
2  female  2012-10-23  2016-06-07
3  female  2012-10-23  2016-06-07
4    male  2012-12-21         NaN
5    male  2010-08-01  2010-08-08
6    male  2010-08-01  2010-08-08

In [19]:
## Join Users to transactions, displaying all matching rows and all non matching row (ful outer join)
user_tranaction_3 = transaction_s.merge(user_s,on='UserID',how='outer')
user_tranaction_3.Registered.fillna('NaT',inplace=True)
user_tranaction_3.Cancelled.fillna('NaT',inplace=True)
print (user_tranaction_3)

    TransactionID TransactionDate  UserID  ProductID  Quantity      User  \
0             1.0      2010-08-21     7.0        2.0       1.0       NaN
1             9.0      2015-04-24     7.0        4.0       3.0       NaN
2             2.0      2011-05-26     3.0        4.0       1.0  Caroline
3             3.0      2011-06-16     3.0        3.0       1.0  Caroline
4             7.0      2013-12-30     3.0        4.0       1.0  Caroline
5            10.0      2016-05-08     3.0        4.0       4.0  Caroline
6             4.0      2012-08-26     1.0        2.0       3.0   Charles
7             5.0      2013-06-06     2.0        4.0       1.0     Pedro
8             6.0      2013-12-23     2.0        5.0       6.0     Pedro
9             8.0      2014-04-24     NaN        2.0       3.0       NaN
10            NaN             NaN     4.0        NaN       NaN   Brielle
11            NaN             NaN     5.0        NaN       NaN  Benjamin

    Gender  Registered   Cancelled
0      NaN         NaT         NaT
1      NaN         NaT         NaT
2   female  2012-10-23  2016-06-07
3   female  2012-10-23  2016-06-07
4   female  2012-10-23  2016-06-07
5   female  2012-10-23  2016-06-07
6     male  2012-12-21         NaT
7     male  2010-08-01  2010-08-08
8     male  2010-08-01  2010-08-08
9      NaN         NaT         NaT
10  female  2013-07-17         NaT
11    male  2010-11-25         NaT

In [20]:
## Build a Data Set with every possible (UserID and ProductID ) pair (Cross Join)
print (user_s.columns)
print (product_s.columns)
print  (len(user_s),len(product_s))

Index(['UserID', 'User', 'Gender', 'Registered', 'Cancelled'], dtype='object')
Index(['ProductID', 'Product', 'Price'], dtype='object')
5 5

In [21]:
df_cross_row = pd.concat([user_s,product_s,transaction_s], axis=0, sort=False) # This is One Method with Axis and Concatination with row wise
df_cross_row # This is not the answere as expected out put

,UserID,User,Gender,Registered,Cancelled,ProductID,Product,Price,TransactionID,TransactionDate,Quantity
0,1.0,Charles,male,2012-12-21,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2.0,Pedro,male,2010-08-01,2010-08-08,NaN,NaN,NaN,NaN,NaN,NaN
2,3.0,Caroline,female,2012-10-23,2016-06-07,NaN,NaN,NaN,NaN,NaN,NaN
3,4.0,Brielle,female,2013-07-17,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,5.0,Benjamin,male,2010-11-25,NaN,NaN,NaN,NaN,NaN,NaN,NaN
0,NaN,NaN,NaN,NaN,NaN,1.0,A,14.16,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN,2.0,B,33.04,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,3.0,C,10.65,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,NaN,4.0,D,10.02,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,5.0,E,29.66,NaN,NaN,NaN
0,7.0,NaN,NaN,NaN,NaN,2.0,NaN,NaN,1.0,2010-08-21,1.0
1,3.0,NaN,NaN,NaN,NaN,4.0,NaN,NaN,2.0,2011-05-26,1.0
2,3.0,NaN,NaN,NaN,NaN,3.0,NaN,NaN,3.0,2011-06-16,1.0
3,1.0,NaN,NaN,NaN,NaN,2.0,NaN,NaN,4.0,2012-08-26,3.0
4,2.0,NaN,NaN,NaN,NaN,4.0,NaN,NaN,5.0,2013-06-06,1.0
5,2.0,NaN,NaN,NaN,NaN,5.0,NaN,NaN,6.0,2013-12-23,6.0
6,3.0,NaN,NaN,NaN,NaN,4.0,NaN,NaN,7.0,2013-12-30,1.0
7,NaN,NaN,NaN,NaN,NaN,2.0,NaN,NaN,8.0,2014-04-24,3.0
8,7.0,NaN,NaN,NaN,NaN,4.0,NaN,NaN,9.0,2015-04-24,3.0
9,3.0,NaN,NaN,NaN,NaN,4.0,NaN,NaN,10.0,2016-05-08,4.0

In [22]:
df_cross_column = pd.concat([user_s,product_s,transaction_s], axis=1, sort=False) # This is One Method with Axis and Concatination with columns
df_cross_column # Same here is This not the expceted answere

,UserID,User,Gender,Registered,Cancelled,ProductID,Product,Price,TransactionID,TransactionDate,UserID,ProductID,Quantity
0,1.0,Charles,male,2012-12-21,NaN,1.0,A,14.16,1,2010-08-21,7.0,2,1
1,2.0,Pedro,male,2010-08-01,2010-08-08,2.0,B,33.04,2,2011-05-26,3.0,4,1
2,3.0,Caroline,female,2012-10-23,2016-06-07,3.0,C,10.65,3,2011-06-16,3.0,3,1
3,4.0,Brielle,female,2013-07-17,NaN,4.0,D,10.02,4,2012-08-26,1.0,2,3
4,5.0,Benjamin,male,2010-11-25,NaN,5.0,E,29.66,5,2013-06-06,2.0,4,1
5,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,6,2013-12-23,2.0,5,6
6,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,7,2013-12-30,3.0,4,1
7,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,8,2014-04-24,NaN,2,3
8,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,9,2015-04-24,7.0,4,3
9,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,10,2016-05-08,3.0,4,4

In [23]:
df_Merge = pd.merge(user_s, product_s,  how='left', left_on=['UserID'], right_on = ['ProductID'])
df_Merge # same as above

   UserID      User  Gender  Registered   Cancelled  ProductID Product  Price
0       1   Charles    male  2012-12-21         NaN          1       A  14.16
1       2     Pedro    male  2010-08-01  2010-08-08          2       B  33.04
2       3  Caroline  female  2012-10-23  2016-06-07          3       C  10.65
3       4   Brielle  female  2013-07-17         NaN          4       D  10.02
4       5  Benjamin    male  2010-11-25         NaN          5       E  29.66

In [24]:
# ## Build a Data Set with every possible (UserID and ProductID ) pair (Cross Join) 
## Here !!! We Go with this solution 
get_index_level = pd.MultiIndex.from_product([user_s.UserID, product_s.ProductID], names = ["UserID", "ProductID"]) 
# Created Level as per item present in both feilds
expected_result = pd.DataFrame(index = get_index_level).reset_index() 
# level reseted and from the data frame as expected (cartesian product)
expected_result

    UserID  ProductID
0        1          1
1        1          2
2        1          3
3        1          4
4        1          5
5        2          1
6        2          2
7        2          3
8        2          4
9        2          5
10       3          1
11       3          2
12       3          3
13       3          4
14       3          5
15       4          1
16       4          2
17       4          3
18       4          4
19       4          5
20       5          1
21       5          2
22       5          3
23       5          4
24       5          5

In [25]:
# Determine how much quantity of each product was purchased by each user

user_product_Transdf = pd.merge(expected_result, transaction_s, how='left', on=['UserID','ProductID'])
#print(user_product_Transdf) #Print the joined dataframe result
user_product_TransdfResult = user_product_Transdf.drop(['TransactionID', 'TransactionDate'], axis=1)


#Drop the unwanted column from the result dataframe and set to a new dataframe
user_product_TransdfResult1 = user_product_TransdfResult.fillna(0)

print(user_product_TransdfResult1) # Print the fnal result
 # Print the fnal result

    UserID  ProductID  Quantity
0        1          1       0.0
1        1          2       3.0
2        1          3       0.0
3        1          4       0.0
4        1          5       0.0
5        2          1       0.0
6        2          2       0.0
7        2          3       0.0
8        2          4       1.0
9        2          5       6.0
10       3          1       0.0
11       3          2       0.0
12       3          3       1.0
13       3          4       1.0
14       3          4       1.0
15       3          4       4.0
16       3          5       0.0
17       4          1       0.0
18       4          2       0.0
19       4          3       0.0
20       4          4       0.0
21       4          5       0.0
22       5          1       0.0
23       5          2       0.0
24       5          3       0.0
25       5          4       0.0
26       5          5       0.0

In [31]:
##For each user, get each possible pair of pair transactions (TransactionID1, TransacationID2)
transactions1 = transaction_s.drop(['UserID'], axis=1) # drop on columns
pair_Of_Transdf = pd.merge(transaction_s, transaction_s, how='left',   on=['UserID']) # left join orginal with new

print(pair_Of_Transdf.sort_values(by=['UserID'],ascending=[False]).head(10))

    TransactionID_x TransactionDate_x  UserID  ProductID_x  Quantity_x  \
0                 1        2010-08-21     7.0            2           1
1                 1        2010-08-21     7.0            2           1
21                9        2015-04-24     7.0            4           3
20                9        2015-04-24     7.0            4           3
24               10        2016-05-08     3.0            4           4
23               10        2016-05-08     3.0            4           4
22               10        2016-05-08     3.0            4           4
18                7        2013-12-30     3.0            4           1
17                7        2013-12-30     3.0            4           1
16                7        2013-12-30     3.0            4           1

    TransactionID_y TransactionDate_y  ProductID_y  Quantity_y
0                 1        2010-08-21            2           1
1                 9        2015-04-24            4           3
21                9        2015-04-24            4           3
20                1        2010-08-21            2           1
24                7        2013-12-30            4           1
23                3        2011-06-16            3           1
22                2        2011-05-26            4           1
18               10        2016-05-08            4           4
17                7        2013-12-30            4           1
16                3        2011-06-16            3           1

In [32]:
# Join each user to his/her first occuring transaction in the transactions table
# first select the first transaction for each user
firstOccur_transactions = transaction_s.groupby('UserID').first().reset_index()

#drop the unwanted column(s)
firstOccur_transactions = firstOccur_transactions.drop(['TransactionDate'], axis=1)

first_Occur_transactions_By_Each_User = pd.merge(user_s, firstOccur_transactions, how='left', on=['UserID'])
print(first_Occur_transactions_By_Each_User)

   UserID      User  Gender  Registered   Cancelled  TransactionID  ProductID  \
0       1   Charles    male  2012-12-21         NaN            4.0        2.0
1       2     Pedro    male  2010-08-01  2010-08-08            5.0        4.0
2       3  Caroline  female  2012-10-23  2016-06-07            2.0        4.0
3       4   Brielle  female  2013-07-17         NaN            NaN        NaN
4       5  Benjamin    male  2010-11-25         NaN            NaN        NaN

   Quantity
0       3.0
1       1.0
2       1.0
3       NaN
4       NaN

In [33]:
# Determine which sessions occurred on the same day each user registered 
pd.merge(left=user_s, right=session_s, how='inner', left_on=['UserID', 'Registered'], right_on=['UserID', 'SessionDate'])

   UserID     User  Gender  Registered   Cancelled  SessionID SessionDate
0       2    Pedro    male  2010-08-01  2010-08-08          2  2010-08-01
1       4  Brielle  female  2013-07-17         NaN          9  2013-07-17

In [34]:
## Test to see if we can drop columns
data_new_each_user = first_Occur_transactions_By_Each_User
my_columns = list(data_new_each_user.columns)
my_columns
['UserID',
'User',
'Gender',
'Registered',
'Cancelled',
'TransactionID',
'TransactionDate',
'ProductID',
'Quantity']
list(data_new_each_user.dropna(thresh=int(data_new_each_user.shape[0] * .9), axis=1).columns) #set threshold to drop NAs
['UserID', 'User', 'Gender', 'Registered']
missing_info = list(data_new_each_user.columns[data_new_each_user.isnull().any()])
missing_info ## Data Where the values are missing

['Cancelled', 'TransactionID', 'ProductID', 'Quantity']

In [35]:
## NOTE : TransactionDate having no null values so program result vary with acutal example provided in question
for col in missing_info: # How many values are missed in columns as well as count
        print ("~*~*"*8)
        num_missing = data_new_each_user[data_new_each_user[col].isnull() == True].shape[0]
        print('number missing for column {}: {}'.format(col, num_missing))
        percent_missing = data_new_each_user[data_new_each_user[col].isnull() == True].shape[0] / len(data_new_each_user[col])
        print('number missing for column {}: {}% .'.format(col, percent_missing*100))
        print ("~*~*"*8)

~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*
number missing for column Cancelled: 3
number missing for column Cancelled: 60.0% .
~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*
~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*
number missing for column TransactionID: 2
number missing for column TransactionID: 40.0% .
~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*
~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*
number missing for column ProductID: 2
number missing for column ProductID: 40.0% .
~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*
~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*
number missing for column Quantity: 2
number missing for column Quantity: 40.0% .
~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*